In [2]:
import pandas as pd
import numpy as np

In [6]:
data = np.arange(0, 50, 10)
data

array([ 0, 10, 20, 30, 40])

In [7]:
a = pd.Series(data, index=['a', 'b', 'c', 'd', 'e'])
a

a     0
b    10
c    20
d    30
e    40
dtype: int64

In [8]:
b = pd.Series(data)
b

0     0
1    10
2    20
3    30
4    40
dtype: int64

In [9]:
a['b']

10

In [12]:
a.loc['b']   #명시적 인덱스

10

In [14]:
a.iloc[1]    #순서

10

In [16]:
## 산술연산

a

a     0
b    10
c    20
d    30
e    40
dtype: int64

In [24]:
a + 10
a - 10
a * 10
a ** 10 ## 제곱
a / 5   # float 형으로 바뀜
a // 5 # 다시 int형
a %3

a    0
b    1
c    2
d    0
e    1
dtype: int64

In [25]:
a

a     0
b    10
c    20
d    30
e    40
dtype: int64

In [26]:
a > 15

a    False
b    False
c     True
d     True
e     True
dtype: bool

In [27]:
a[a > 15]

c    20
d    30
e    40
dtype: int64

In [28]:
## 집계함수

a.add(100)

a    100
b    110
c    120
d    130
e    140
dtype: int64

In [29]:
a.sub(100) # -

a   -100
b    -90
c    -80
d    -70
e    -60
dtype: int64

In [30]:
a.mul(100)    # *

a       0
b    1000
c    2000
d    3000
e    4000
dtype: int64

In [31]:
a.div(100)    # 나누기

a    0.0
b    0.1
c    0.2
d    0.3
e    0.4
dtype: float64

In [32]:
a.mod(3)    # 나머지연산

a    0
b    1
c    2
d    0
e    1
dtype: int64

In [33]:
a.min()  #최솟값

0

In [34]:
a.maw()   #최댓값

40

In [35]:
a.sum()   #전체합

100

In [36]:
a.mean()   #평균

20.0

In [37]:
a.median()   #중앙값

20.0

In [38]:
a.std()  #표준편차

15.811388300841896

In [39]:
a.var()   #분산

250.0

In [40]:
## dataframe

In [80]:
rawData = np.random.randint(50, 100, size=(4, 3))
rawData

array([[91, 55, 76],
       [77, 52, 58],
       [62, 93, 60],
       [89, 88, 90]])

In [81]:
df = pd.DataFrame(rawData, 
                  index=['1반', '2반', '1반', '2반'],
                  columns=['국', '영', '수'])
df

     국   영   수
1반  91  55  76
2반  77  52  58
1반  62  93  60
2반  89  88  90

In [82]:
# df[0] -> ERROR

df['국']

1반    91
2반    77
1반    62
2반    89
Name: 국, dtype: int64

In [83]:
df

     국   영   수
1반  91  55  76
2반  77  52  58
1반  62  93  60
2반  89  88  90

In [84]:
df['평균'] = round((df['국'] + df['영'] + df['수'])/3, 2) # 3으로 나누어 소수점 2자리까지 
df

     국   영   수     평균
1반  91  55  76  74.00
2반  77  52  58  62.33
1반  62  93  60  71.67
2반  89  88  90  89.00

In [85]:
df['na'] = np.nan  ##결집체
df

     국   영   수     평균  na
1반  91  55  76  74.00 NaN
2반  77  52  58  62.33 NaN
1반  62  93  60  71.67 NaN
2반  89  88  90  89.00 NaN

In [86]:
del df['na']  ##결집체 del
df

     국   영   수     평균
1반  91  55  76  74.00
2반  77  52  58  62.33
1반  62  93  60  71.67
2반  89  88  90  89.00

In [87]:
df[df.평균 >80]   #불련인덱싱

     국   영   수    평균
2반  89  88  90  89.0

In [88]:
df = df.drop(['평균'], axis='columns')
df

     국   영   수
1반  91  55  76
2반  77  52  58
1반  62  93  60
2반  89  88  90

In [89]:
## 결측값 처리    #중간에 데이터가 비어있거나, 공백으로 들어가 있는 경우

In [91]:
df = df.astype('float64')
df

       국     영     수
1반  91.0  55.0  76.0
2반  77.0  52.0  58.0
1반  62.0  93.0  60.0
2반  89.0  88.0  90.0

In [94]:
df['수'][2] = np.nan
df

       국     영     수
1반  91.0  55.0  76.0
2반  77.0  52.0  58.0
1반  62.0  93.0   NaN
2반  89.0  88.0  90.0

In [95]:
df.dropna(axis=0)   # 1행 지우기 #inplac= True로 하면 원본값까지 바뀜

       국     영     수
1반  91.0  55.0  76.0
2반  77.0  52.0  58.0
2반  89.0  88.0  90.0

In [96]:
df   #원본은 그대로

       국     영     수
1반  91.0  55.0  76.0
2반  77.0  52.0  58.0
1반  62.0  93.0   NaN
2반  89.0  88.0  90.0

In [97]:
df.dropna(axis=1)   #1열 지우기

       국     영
1반  91.0  55.0
2반  77.0  52.0
1반  62.0  93.0
2반  89.0  88.0

In [99]:
df.fillna('hello')

       국     영      수
1반  91.0  55.0   76.0
2반  77.0  52.0   58.0
1반  62.0  93.0  hello
2반  89.0  88.0   90.0

In [100]:
df.fillna(0)

       국     영     수
1반  91.0  55.0  76.0
2반  77.0  52.0  58.0
1반  62.0  93.0   0.0
2반  89.0  88.0  90.0

In [101]:
df.fillna(df.mean())  #평균으로 채우기

       국     영          수
1반  91.0  55.0  76.000000
2반  77.0  52.0  58.000000
1반  62.0  93.0  74.666667
2반  89.0  88.0  90.000000

In [102]:
##MULTIINDEX

In [103]:
df

       국     영     수
1반  91.0  55.0  76.0
2반  77.0  52.0  58.0
1반  62.0  93.0   NaN
2반  89.0  88.0  90.0

In [106]:
df.T   ##행과 열을 바꾸기

     1반    2반    1반    2반
국  91.0  77.0  62.0  89.0
영  55.0  52.0  93.0  88.0
수  76.0  58.0   NaN  90.0

In [108]:
df.index = [['1학년', '1학년', '2학년', '2학년'], ['1반', '2반', '1반', '2반']]
df

           국     영     수
1학년 1반  91.0  55.0  76.0
    2반  77.0  52.0  58.0
2학년 1반  62.0  93.0   NaN
    2반  89.0  88.0  90.0

In [109]:
df.columns = [['언어', '언어', '수리'], ['국', '영', '수']]
df

          언어          수리
           국     영     수
1학년 1반  91.0  55.0  76.0
    2반  77.0  52.0  58.0
2학년 1반  62.0  93.0   NaN
    2반  89.0  88.0  90.0

In [111]:
df['언어']

           국     영
1학년 1반  91.0  55.0
    2반  77.0  52.0
2학년 1반  62.0  93.0
    2반  89.0  88.0

In [112]:
df['언어']['국']

1학년  1반    91.0
     2반    77.0
2학년  1반    62.0
     2반    89.0
Name: 국, dtype: float64

In [115]:
df.iloc[0]  #indexlocation

언어  국    91.0
    영    55.0
수리  수    76.0
Name: (1학년, 1반), dtype: float64

In [116]:
df.loc['1학년']

      언어          수리
       국     영     수
1반  91.0  55.0  76.0
2반  77.0  52.0  58.0

In [117]:
df.loc['1학년'].loc['1반']

언어  국    91.0
    영    55.0
수리  수    76.0
Name: 1반, dtype: float64

In [118]:
## 데이터 사전 분석

In [120]:
df

          언어          수리
           국     영     수
1학년 1반  91.0  55.0  76.0
    2반  77.0  52.0  58.0
2학년 1반  62.0  93.0   NaN
    2반  89.0  88.0  90.0

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 4 entries, ('1학년', '1반') to ('2학년', '2반')
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   (언어, 국)  4 non-null      float64
 1   (언어, 영)  4 non-null      float64
 2   (수리, 수)  3 non-null      float64
dtypes: float64(3)
memory usage: 384.0+ bytes

In [122]:
df.head()

          언어          수리
           국     영     수
1학년 1반  91.0  55.0  76.0
    2반  77.0  52.0  58.0
2학년 1반  62.0  93.0   NaN
    2반  89.0  88.0  90.0

In [123]:
df.tail()

          언어          수리
           국     영     수
1학년 1반  91.0  55.0  76.0
    2반  77.0  52.0  58.0
2학년 1반  62.0  93.0   NaN
    2반  89.0  88.0  90.0

In [124]:
df.dtypes

언어  국    float64
    영    float64
수리  수    float64
dtype: object

In [125]:
df.describe()

             언어                    수리
              국          영          수
count   4.00000   4.000000   3.000000
mean   79.75000  72.000000  74.666667
std    13.35103  21.494185  16.041613
min    62.00000  52.000000  58.000000
25%    73.25000  54.250000  67.000000
50%    83.00000  71.500000  76.000000
75%    89.50000  89.250000  83.000000
max    91.00000  93.000000  90.000000

In [126]:
df.isnull()

           언어            수리
            국      영      수
1학년 1반  False  False  False
    2반  False  False  False
2학년 1반  False  False   True
    2반  False  False  False

In [127]:
df.isnull().sum()

언어  국    0
    영    0
수리  수    1
dtype: int64

In [128]:
## 값의 연결

In [133]:
a = pd.DataFrame(np.arange(1, 10).reshape(3, 3))
a

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [134]:
b = pd.Series(np.arange(10, 40, 10))
b

0    10
1    20
2    30
dtype: int64

In [135]:
pd.concat([a, b], axis=1)   ##열이 합쳐지기

   0  1  2   0
0  1  2  3  10
1  4  5  6  20
2  7  8  9  30

In [136]:
pd.concat([a, b], axis=1, ignore_index=True)  # 열을 3으로 합치고싶다

   0  1  2   3
0  1  2  3  10
1  4  5  6  20
2  7  8  9  30

In [137]:
a.append(b, ignore_index=True)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  20  30